public_html/docs/Misc/GR.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ricoh GR</title>
<!-- 2015-12-23 Wed 21:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Ricoh GR</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">nacoki</a></li>
<li><a href="#sec-2">理光GR拍摄设置经验、技巧大全</a></li>
<li><a href="#sec-3">经典延续 理光GR海外长期使用心得</a></li>
<li><a href="#sec-4">Groups</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">nacoki</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.flickr.com/photos/nacoki/269246217">https://www.flickr.com/photos/nacoki/269246217</a>
</p>

<p>
Recent some flickr ask me about the trick on GR-D
so I would like to share some of my experience on using this.
</p>

<p>
the basic setting of my GR-D
</p>
<ul class="org-ul">
<li>customize image setting 1
</li>
<li>highest contrast
</li>
<li>highest sharpness
</li>
<li>highest color depth ( i think this also relate to the saturation of the photo )
</li>
</ul>

<p>
many people ask about the post-production,
actually i m quite lazy on this, n i m not good at photoshop
so, all of my photo are using iPhoto 6 to manage.
as the setting in the GR-D are already enough,
so i will only increase the CONTRAST on some of the photo,
to make the subject matter much sharp.
</p>

<p>
the mode I always use:
</p>
<ul class="org-ul">
<li>P mode ( nearly all the time *daylight )
</li>
<li>AUTO iso ( range 64- 200) * over 200 will affect the color as i feel
</li>
<li>AUTO white balance ( actually always wrong )
</li>
<li>customize image setting 1
</li>
<li>MULTI AF ( favourable for MACRO )
</li>
<li>MULTI photometry ( easy to get some interesting light effect )
</li>

<li>M mode ( when i want to have long exposure * night time/ low light intensity)
</li>
<li>same as P mode setting
</li>
<li>f 2.4
</li>
<li>duration (2 sec -15 sec) * above 15 sec, the GR-D loading like a fool :P
</li>
</ul>

<p>
many people ask about the COLOR of my photo,
the main point isn't the post-production,
or the customize setting ( but i prefer using the maximum )
But what i think is the SHUTTER SPEED.
when you compare with two setting,
</p>
<ul class="org-ul">
<li>f2.4, 1 sec , iso AUTO ( assume to be 200 )
</li>
<li>f2.4, 1/10 , iso 800
</li>
</ul>
<p>
I can sure the one with 1 sec have better color result,
as it accumulate more light
instead of push up the iso.
GR-D is a strange machine,
the longer time exposure = vivid color.
</p>

<p>
e.g.
www.flickr.com/photos/nacoki/267170208/
</p>


<p>
I found that when you using P mode,
the slowest shutter speed is 1 sec,
as it is quite enough for many situation
BUT you need to have a STEADY HAND ( maybe you can use triport )
actually many of my photo are shooting at 1 sec.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">理光GR拍摄设置经验、技巧大全</h2>
<div class="outline-text-2" id="text-2">
<p>
一、高对比黑白（森山模式）高对比黑白，必须用点测光。——来自：垃圾叔叔 
</p>

<p>
1：设定 鲜艳度5 对比度5 鲜明度6 然后 白平衡 复合 B2G2 重点测光 效果完美——来自：垃圾叔叔 
</p>

<p>
二、快门次数查看方法：关机状态下，按住播放键和方向键（下），就可以看到你的快门次数。 
</p>
<ul class="org-ul">
<li>SH 快门数 
</li>
<li>ST 闪光灯数 
</li>
</ul>

<p>
今天发现理光一个小功能很好用菜单里的完全自动对焦，设置为开启后，快速按下快门，即可按照snap预设直接拍摄慢一点半按快门，照旧对焦——来自Reven 
</p>


<p>
三、关于设置ISO100，自动变为ISO320的解决方法
</p>

<p>
把“动态范围补偿”设定为“关”（默认设置是“自动”），然后再回到感光度调节菜单，ISO设定多少就是多少，不会再变成320. 欢迎盖楼交流设置心得。 
</p>


<p>
四、理光GRⅡ固件更新方法 
</p>
<ol class="org-ol">
<li>首先下固件固件下载：
<a href="http://www.ricoh-imaging.com.cn/ricoh/DownloadServlet?param=queryDetail&id=53">http://www.ricoh-imaging.com.cn/ricoh/DownloadServlet?param=queryDetail&id=53</a> 
</li>
<li>格式化SD卡（卡内资料请保存），然后将固件解压缩，放SD卡根目录 
</li>
<li>然后开机，按menu，选第三个设定，最后一个“确认固件版本”，然后选确定。 下载的文件解压后，放到sd卡根目录下，开机，打开菜单，检查固件版本，确认升级就可以了。完成后先别开机，先把sd卡上的固件文件删了，然后就好了 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">经典延续 理光GR海外长期使用心得</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://photo.poco.cn/special_topic/topic_id-15819-p-1.html#content_hash">http://photo.poco.cn/special_topic/topic_id-15819-p-1.html#content_hash</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Groups</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://www.douban.com/group/grd/">GR Fans Club</a>
</li>
<li><a href="http://www.douban.com/group/476211/?ref=sidebar">理光GR \ GRⅡ俱乐部</a>
</li>
<li><a href="http://www.douban.com/group/147985/">理光GR系列</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-12-23 Wed 21:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
